# 额外软件源(Tap)
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions" # 允许下载一些旧版本软件，使用@指定版本号


brew "btop"
brew "ffmpeg"
brew "mackup"
brew "mas"
brew "minikube"
brew "nali"
brew "neovim"
brew "rust"
brew "telnet"
brew "yt-dlp"
brew "gh" #Github CLI
brew "git"
brew "grep" # 使用GNU `grep` macOS 默认安装FreeBSD `grep`
brew "jq"
brew "exa" # Modern replacement for `ls` 

# 等待区
# brew "fd" # find 替代， 可配合fzf
# brew "fzf" # Command-line fuzzy finder written in Go

# 从官网下载的二进制软件包
cask "alfred"
cask "1password"
cask "devonthink"
cask "iina"
cask "iterm2"
cask "spotify"
cask "squirrel"
cask "visual-studio-code"
cask "google-chrome"
cask "firefox"
cask "bartender"
cask "cleanshot"
cask "forklift"
cask "dropbox"
cask "nutstore"
cask "thunderbird"
cask "hazel"
cask "clashx"

# 从App Store下载的软件
mas "Things", id: 904280696
mas "Bob", id: 1630034110
mas "Kindle", id: 405399194
mas "WeChat", id: 836500024
mas "Infuse", id: 1136220934
mas "PopClip", id: 445189367